# Pandas in Python

## What is Pandas?

* Pandas is an open source library built on top of NumPy.
* It allows for fast analysis and data cleaning and prepation.
* It is excellent in performance and gives a great productivity.
* It also has built_in features for visualization.
* Pandas can work with data from wide variety of sources.

## Why do we use Pandas?

* Extract data from CSV file or any other database.
* Calculate statistics and Clean data by removing missing values and filtering rows and columns.
* Visualize data with the help of Matplotlib,Plot bars,Lines<histograms and many more.
* Store the cleaned,transformed data back into the CSV file or  database.

* You"ll need to install pandas by going to your command line or terminal and using either-
#### condo install pandas
#### pip install pandas


## Topics to be covered in Pandas-

* Series
* DataFrames
* Missing Data
* GroupBY
* Merging,Joining and Concatenating
* Operations
* Data Input and Output

### 1. Series-

* A series is a one-dimensional data structure. 
* It can have any data structure like integer, float, and string. 
* It is useful if we want to perform computation or return a one-dimensional array.
* A series cannot have multiple columns.
* If we want multiple columns,we will use the data frames.

In [6]:
import numpy as np

In [5]:
import pandas as pd

In [18]:
labels = [ 'a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [16]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

#### 1.1 If we want to customize the index.

In [22]:
pd.Series(data=my_data,index=labels) #here we are indexing it with list of labels.

a    10
b    20
c    30
dtype: int64

#### 1.2 Let us pass a numpy array.

In [25]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

#### 1.3 Let us pass a dictionary.

In [29]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [34]:
 ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [35]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [43]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [45]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

#### 1.4 If we want to get an index-

In [48]:
ser1['USA']

1

In [50]:
ser3 = pd.Series(data=labels)

#### 1.5 If we want the value of the specific index-

In [53]:
ser3[0] #we pass index 0.

'a'

#### 1.6 We can also add the two series-

In [57]:
ser1 + ser2 #we did not find the match for Italy and USSR so it gave us NaN.

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## 2. DataFrames.

* DataFrames is the main tool when we are working with pandas.
* A data frame is a two-dimensional array, with lablled rows and columns. 
* A data frame is a standard way to store data.
* A data frame is a tabular data, with rows to store the information and columns to name the information.
* A data frame is a bunch of series with the same indexes.

In [60]:
import numpy as pd
import pandas as pd

In [63]:
from numpy.random import randn #this is used to import the random numbers

In [80]:
np.random.seed(101) #this is to set the same random numbers.

#### 2.1 Creating a DataFrame

* You can convert any numpy array to DataFrame using pd.DataFrame()
* Init signature: pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

In [81]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #setting random numbers and index and columns

In [82]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### 2.2 Let us get a single series 'W'

In [90]:
df['W'] #we can multiple columns as well by addiing column names.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

#### 2.3 Adding Columns

In [97]:
df['new'] = df['W'] + df['Y'] #we are adding a new column which is the addition of the w and y.

In [98]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

#### 2.4 Removing Columns
* we use df.drop(labels,axis=1) to remove a column.

In [ ]:
df.drop('new',axis=1,inplace=True) #here we use inplace=True to permanently remove the column.

In [113]:
df #we can see there is no 'new 'now

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### 2.5 Removing Rows
* we use df.drop(labels,axis=1) to remove a column.|

In [ ]:
df.drop('E',axis=0,inplace=True) #here we use axis=0 ,inplace=True to permanently remove the row.

In [124]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

#### 2.6 Selecting Rows
* we use df.loc['name of the row'] to find a specific row.

In [129]:
df.loc['B'] #here we get the row B using the label based index.

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [131]:
df.iloc[2] #we get the row by integer-location based indexing.

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

#### 2.7 Getting the subset of the rows and columns.

* we use df.loc[row,column] to get the specific location value.

In [133]:
df.loc['B','Y'] #we get value at location B row and Y column

-0.8480769834036315

In [135]:
df.loc[['A','B'],['W','Y']] #we get here values at Rows A and B and Columns W and Y

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

#### 2.8 Conditional DataFrame
* We can use df>0 to get theresult of the condition in the DataFrame.

In [140]:
booldf = df > 0

In [143]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

#### If we want values which are true then we will use []

In [145]:
df[booldf] #we will get only True values.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [149]:
df['W']>0 #this isused to get the condition of the specific column.

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [159]:
df[df['W']>0] #this will give us the rows which are true.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [161]:
df[df['W']>0][['W','Y']] #this is to get the dataframe of W and Y with the condition

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
D  0.188695 -0.933237

#### Let us use the '&' operator to show merge 2 conditons.

In [166]:
df[(df['W']>0) & (df['Y']>1)] #here we have used 2 conditions.

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [167]:
#### Let us use the '|' operator to show merge 2 conditons.

In [169]:
df[(df['W']>0) | (df['Y']>1)] #here we have used the or operator.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [173]:
df.reset_index() #this will give us the index column and a column in integers.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

#### 2.9 Adding a new Index.

In [174]:
newind = 'CA WY OR CO'.split() #we use split to split the string

In [175]:
newind

['CA', 'WY', 'OR', 'CO']

In [188]:
df['States'] = newind

In [189]:
df

          W         X         Y         Z states States
A  2.706850  0.628133  0.907969  0.503826     CA     CA
B  0.651118 -0.319318 -0.848077  0.605965     WY     WY
C -2.018168  0.740122  0.528813 -0.589001     OR     OR
D  0.188695 -0.758872 -0.933237  0.955057     CO     CO

#### Assigning a new Index.

In [195]:
df.set_index('States')#here the new index is set to states.

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
WY      0.651118 -0.319318 -0.848077  0.605965
OR     -2.018168  0.740122  0.528813 -0.589001
CO      0.188695 -0.758872 -0.933237  0.955057

#### 3.Missing Data

* There are a few convinient methods to deal with the missing data in Pandas.
* Sometimes when there are no values in a certain location ,the block is filled with Nan.
* We will learn how to fill those missing values by dropping or filling the Nan.

In [197]:
import numpy as np
import pandas as pd

In [198]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [214]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### 3.1 Dropping Nan values.

* we will use df.dropna() to drop Nan.

In [208]:
df.dropna() #this will remove all the rows with Nan.

     A    B  C
0  1.0  5.0  1

In [211]:
df.dropna(axis=1) #this will remove all the columns with Nan.

   C
0  1
1  2
2  3

In [216]:
df.dropna(thresh=2) #we have set the thresh to 2 ,this will remove the rows with atleast 2 Nan.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

#### 3.2 Filling the missing values.

* We will use df.fillna(value='FILL VALUE') to fill a value.

In [219]:
df.fillna(value='FILL VALUE') #here we can fill any value we want

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

#### 4. Groupby

* Groupby allows you to group together rows based oof of a column and perform an aggregate function on them.
* We use the df.groupby to group the data.

In [221]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [226]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [227]:
byComp = df.groupby('Company')

In [229]:
byComp.mean() #here we are grouping by mean.

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [231]:
byComp.sum() #here we are grouping by sum.

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [234]:
byComp.sum().loc['FB'] #this is used to get a value of specific group

Sales    593
Name: FB, dtype: int64

In [236]:
df.groupby('Company').min() #this will give us min  value.

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [238]:
df.groupby('Company').max() #this will give us max value.

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

#### Decribe() will give us all the information regarding the data.

In [244]:
df.groupby('Company').describe() #this will give us all the info about the data.

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

#### Transpose() will give us all the index as column.

In [246]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

#### 5.Merging,Joining and Concatenating

* Pandas provides various facilities for easily combining together Series or DataFrame.
* There are various kinds of set logic for the indexes and relational algebra functionality in the case of join, merge and concatenate operations.

##### Let us create 3 DataFrames-

In [247]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [248]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [249]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [251]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [253]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [255]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### 5.1 Concatenation-

* Concatanetion basically glues together the DataFrames.
* The dimensions should match along the axis you are concatenating on.
* You can use pd.concat and pass in a list of DataFrames to concatenate together.
* We will use pd.concat() to concatenate.

In [258]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### 5.2 Merging

* The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.
* we will use pd.merge()
* For example:

In [261]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [265]:
pd.merge(left,right,how='inner',on='key') #here we are merging with key

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

#### 5.3 Joining 

* Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.
*  For Exaple-

In [270]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [272]:
left.join(right) #joining left and right base don key.

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [274]:
left.join(right, how='outer') #joining left and right based on outer join.

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### 6. Operations

* Here we will learn more about the operations in Pandas.

In [277]:

df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

####  6.1 Unique Values-

* We can use df.unique() to get all the unique values in the column.

In [279]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

 #### 6.2 This will give us the length of the unique values.

In [281]:
df['col2'].nunique()

3

#### This returns how many times that value occured in the column.

In [284]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [287]:
df[df['col1']>2] #this will the values in col2 >2

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [290]:
df[(df['col1']>2) & (df['col2']==444)] #this will the values in col2 >2 and 444

   col1  col2 col3
3     4   444  xyz

In [292]:
df['col1']>2 #this will give result of the condition

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

#### 6.4 Apply Method-

* Apply method is used to define functions and perform mathematical operations by defining functions.
* We use df['name'].apply()

In [294]:
def times2(x):
    return x*2 #let us define a func

In [296]:
df['col1'].apply(times2) #we applied the function on col1.

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [297]:
df['col3'].apply(len) #this will give us the length of the string.

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [299]:
df['col2'].apply(lambda x: x*2) #this is important in Pandas,We can define our own lambda.

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

#### 6.5 Permanenetly removing a column.

In [302]:
del df['col1']

In [304]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### 6.6 Get columns.

In [306]:
df.columns

Index(['col2', 'col3'], dtype='object')

#### 6.7 Get Index-

In [308]:
df.index

RangeIndex(start=0, stop=4, step=1)

#### 6.8 Sorting and ordering a DataFrame-

In [311]:
df.sort_values(by='col2') #we have sorted here acc to column 2

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

#### Find NULL values

In [314]:
df.isnull() #this will us condition of the null values

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

### 7 Data Input and Output

* Pandas can read a variety of file types using its pd.read_ methods. 
* Let's take a look at the most common data types:

* CSV
* Excel
* HTML

import pandas as pd

In [317]:
pwd #this will give us the location of jupyter notebook.

'C:\\Users\\Harsh Patel'

#### 7.1 CSV-

In [344]:
df=pd.read_csv('example')
df #we can read a csv file

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [350]:
df.to_csv('example',index=False) #we get output

#### 7.2 EXCEL-

* Pandas can read and write excel files, keep in mind, this only imports data.
* Not formulas or images, having images or macros may cause this read_excel method to crash.

In [355]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1') #we read the excel file

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [356]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1') #output of the excel.

#### 7.3 HTML

* You may need to install htmllib5,lxml, and BeautifulSoup4. 
* In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

* Then restart Jupyter Notebook.
* (or use pip install if you aren't using the Anaconda Distribution)

* Pandas can read table tabs off of html. For example:

In [368]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html') #we have got an html link from web.

In [365]:
df[0] #we get the dataframe we are looking for.

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
5,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","January 29, 2019"
6,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","January 29, 2019"
7,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","January 29, 2019"
8,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","September 20, 2019"
9,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","May 13, 2019"
10,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","December 13, 2018"
11,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","November 13, 2018"
12,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 14, 2018"
13,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","January 29, 2019"
14,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","February 19, 2018"
15,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","July 9, 2018"
16,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","February 20, 2018"
17,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","January 29, 2019"
18,Doral Bank En Español,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","January 29, 2019"
19,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015","January 29, 2019"
20,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015","November 15, 2017"
21,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","November 15, 2017"
22,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 3, 2018"
23,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","November 10, 2016"
24,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016"
25,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","January 29, 2019"
26,"GreenChoice Bank, fsb",Chicago,IL,28462,"Providence Bank, LLC","July 25, 2014","December 12, 2016"
27,Eastside Commercial Bank,Conyers,GA,58125,Community & Southern Bank,"July 18, 2014","October 6, 2017"
28,The Freedom State Bank,Freedom,OK,12483,Alva State Bank & Trust Company,"June 27, 2014","February 21, 2018"
29,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association","June 20, 2014","January 29, 2019"
...,...,...,...,...,...,...,...
526,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008","February 1, 2019"
527,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008","January 31, 2019"
528,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008","October 26, 2012"
529,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007","September 12, 2016"
530,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007","January 31, 2019"
531,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007","October 27, 2010"
532,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004","April 9, 2008"
533,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004","April 9, 2008"
534,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004","April 17, 2018"
535,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004","April 9, 2008"
536,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003","October 6, 2017"
537,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003","June 5, 2012"
538,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003","October 20, 2008"
539,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002","October 20, 2004"
540,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002","March 18, 2005"
541,AmTrade International Bank En Español,Atlanta,GA,33784,No Acquirer,"September 30, 2002","September 11, 2006"
542,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002","October 6, 2017"
543,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002","February 14, 2012"
544,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002","March 18, 2005"
545,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002","April 9, 2008"
546,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002","February 5, 2015"
547,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002","October 25, 2012"
548,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002","November 6, 2003"
549,"Hamilton Bank, NA En Español",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002","September 21, 2015"
550,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001","October 6, 2017"
551,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
552,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
553,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
554,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
555,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

### Citations-
* www.pandas.pydata.org
* www.w3schools.com
* www.youtube.com